FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/M2351.h
    #include "core_armv8mbl.h"              /* Processor and core peripherals */
    #include "system_M2351.h"               /* System Header */

/**
 * Initialize the system clock
 *
 * @param  none
 * @return none
 *
 * @brief  Setup the micro controller system
 *         Initialize the PLL and update the SystemFrequency variable
 */
    extern void SystemInit( void );


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/


    #include "acmp_reg.h"
    #include "bpwm_reg.h"
    #include "can_reg.h"
    #include "clk_reg.h"
    #include "crc_reg.h"
    #include "dac_reg.h"
    #include "eadc_reg.h"
    #include "ebi_reg.h"
    #include "ecap_reg.h"
    #include "fmc_reg.h"
    #include "gpio_reg.h"
    #include "hdiv_reg.h"
    #include "i2c_reg.h"
    #include "i2s_reg.h"
    #include "pdma_reg.h"
    #include "epwm_reg.h"
    #include "qei_reg.h"
    #include "rtc_reg.h"
    #include "sc_reg.h"
    #include "scu_reg.h"
    #include "sdh_reg.h"
    #include "qspi_reg.h"
    #include "spi_reg.h"
    #include "sys_reg.h"
    #include "timer_reg.h"
    #include "trng_reg.h"
    #include "uart_reg.h"
    #include "ui2c_reg.h"
    #include "usbh_reg.h"
    #include "usbd_reg.h"
    #include "otg_reg.h"
    #include "crpt_reg.h"
    #include "uspi_reg.h"
    #include "uuart_reg.h"
    #include "wdt_reg.h"
    #include "wwdt_reg.h"


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/

/** @addtogroup PERIPHERAL_BASE Peripheral Memory Base
 * Memory Mapped Structure for Series Peripheral
 * @{
 */


/* Peripheral and SRAM base address */
    #define SRAM_BASE             ( 0x20000000UL )                       /*!< (SRAM      ) Base Address */
    #define PERIPH_BASE           ( 0x40000000UL )                       /*!< (Peripheral) Base Address */
    #define NS_OFFSET             ( 0x10000000UL )

/* Peripheral memory map */
    #define AHBPERIPH_BASE        PERIPH_BASE
    #define APBPERIPH_BASE        ( PERIPH_BASE + 0x00040000UL )

/*!< AHB peripherals */
    #define SYS_BASE              ( AHBPERIPH_BASE + 0x00000UL )
    #define CLK_BASE              ( AHBPERIPH_BASE + 0x00200UL )
    #define INT_BASE              ( AHBPERIPH_BASE + 0x00300UL )
    #define GPIO_BASE             ( AHBPERIPH_BASE + 0x04000UL )
    #define GPIOA_BASE            ( AHBPERIPH_BASE + 0x04000UL )
    #define GPIOB_BASE            ( AHBPERIPH_BASE + 0x04040UL )
    #define GPIOC_BASE            ( AHBPERIPH_BASE + 0x04080UL )
    #define GPIOD_BASE            ( AHBPERIPH_BASE + 0x040C0UL )
    #define GPIOE_BASE            ( AHBPERIPH_BASE + 0x04100UL )
    #define GPIOF_BASE            ( AHBPERIPH_BASE + 0x04140UL )
    #define GPIOG_BASE            ( AHBPERIPH_BASE + 0x04180UL )
    #define GPIOH_BASE            ( AHBPERIPH_BASE + 0x041C0UL )
    #define GPIO_DBCTL_BASE       ( AHBPERIPH_BASE + 0x04440UL )
    #define GPIO_PIN_DATA_BASE    ( AHBPERIPH_BASE + 0x04800UL )
    #define PDMA0_BASE            ( AHBPERIPH_BASE + 0x08000UL )
    #define PDMA1_BASE            ( AHBPERIPH_BASE + 0x18000UL )
    #define USBH_BASE             ( AHBPERIPH_BASE + 0x09000UL )
    #define FMC_BASE              ( AHBPERIPH_BASE + 0x0C000UL )
    #define SDH0_BASE             ( AHBPERIPH_BASE + 0x0D000UL )
    #define SDH1_BASE             ( AHBPERIPH_BASE + 0x0E000UL )
    #define EBI_BASE              ( AHBPERIPH_BASE + 0x10000UL )
    #define CRC_BASE              ( AHBPERIPH_BASE + 0x31000UL )
    #define CRPT_BASE             ( AHBPERIPH_BASE + 0x32000UL )
    #define SCU_BASE              ( AHBPERIPH_BASE + 0x2F000UL )

/*!< APB peripherals */
    #define WDT_BASE              ( APBPERIPH_BASE + 0x00000UL )
    #define WWDT_BASE             ( APBPERIPH_BASE + 0x00100UL )
    #define RTC_BASE              ( APBPERIPH_BASE + 0x01000UL )
    #define EADC_BASE             ( APBPERIPH_BASE + 0x03000UL )
    #define ACMP01_BASE           ( APBPERIPH_BASE + 0x05000UL )
    #define DAC0_BASE             ( APBPERIPH_BASE + 0x07000UL )
    #define DAC1_BASE             ( APBPERIPH_BASE + 0x07040UL )
    #define I2S0_BASE             ( APBPERIPH_BASE + 0x08000UL )
    #define OTG_BASE              ( APBPERIPH_BASE + 0x0D000UL )
    #define TMR01_BASE            ( APBPERIPH_BASE + 0x10000UL )
    #define TMR23_BASE            ( APBPERIPH_BASE + 0x11000UL )
    #define EPWM0_BASE            ( APBPERIPH_BASE + 0x18000UL )
    #define EPWM1_BASE            ( APBPERIPH_BASE + 0x19000UL )
    #define BPWM0_BASE            ( APBPERIPH_BASE + 0x1A000UL )
    #define BPWM1_BASE            ( APBPERIPH_BASE + 0x1B000UL )
    #define QSPI0_BASE            ( APBPERIPH_BASE + 0x20000UL )
    #define SPI0_BASE             ( APBPERIPH_BASE + 0x21000UL )
    #define SPI1_BASE             ( APBPERIPH_BASE + 0x22000UL )
    #define SPI2_BASE             ( APBPERIPH_BASE + 0x23000UL )
    #define SPI3_BASE             ( APBPERIPH_BASE + 0x24000UL )
    #define UART0_BASE            ( APBPERIPH_BASE + 0x30000UL )
    #define UART0_BASE            ( APBPERIPH_BASE + 0x30000UL )
    #define UART1_BASE            ( APBPERIPH_BASE + 0x31000UL )
    #define UART2_BASE            ( APBPERIPH_BASE + 0x32000UL )
    #define UART3_BASE            ( APBPERIPH_BASE + 0x33000UL )
    #define UART4_BASE            ( APBPERIPH_BASE + 0x34000UL )
    #define UART5_BASE            ( APBPERIPH_BASE + 0x35000UL )
    #define I2C0_BASE             ( APBPERIPH_BASE + 0x40000UL )
    #define I2C1_BASE             ( APBPERIPH_BASE + 0x41000UL )
    #define I2C2_BASE             ( APBPERIPH_BASE + 0x42000UL )
    #define SC0_BASE              ( APBPERIPH_BASE + 0x50000UL )
    #define SC1_BASE              ( APBPERIPH_BASE + 0x51000UL )
    #define SC2_BASE              ( APBPERIPH_BASE + 0x52000UL )
    #define CAN0_BASE             ( APBPERIPH_BASE + 0x60000UL )
    #define QEI0_BASE             ( APBPERIPH_BASE + 0x70000UL )
    #define QEI1_BASE             ( APBPERIPH_BASE + 0x71000UL )
    #define ECAP0_BASE            ( APBPERIPH_BASE + 0x74000UL )
    #define ECAP1_BASE            ( APBPERIPH_BASE + 0x75000UL )
    #define TRNG_BASE             ( APBPERIPH_BASE + 0x79000UL )
    #define USBD_BASE             ( APBPERIPH_BASE + 0x80000UL )
    #define USCI0_BASE            ( APBPERIPH_BASE + 0x90000UL )
    #define USCI1_BASE            ( APBPERIPH_BASE + 0x91000UL )


/**@}*/ /* PERIPHERAL */

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/

