FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/M2351.h
/** @addtogroup PMODULE Peripheral Pointer
 * The Declaration of Peripheral Pointer
 * @{
 */

/** @addtogroup PMODULE_S Secure Peripheral Pointer
 * The Declaration of Secure Peripheral Pointer
 * @{
 */


    #define PA        ( ( GPIO_T * ) GPIOA_BASE )                       /*!< GPIO PORTA Pointer                 */
    #define PB        ( ( GPIO_T * ) GPIOB_BASE )                       /*!< GPIO PORTB Pointer                 */
    #define PC        ( ( GPIO_T * ) GPIOC_BASE )                       /*!< GPIO PORTC Pointer                 */
    #define PD        ( ( GPIO_T * ) GPIOD_BASE )                       /*!< GPIO PORTD Pointer                 */
    #define PE        ( ( GPIO_T * ) GPIOE_BASE )                       /*!< GPIO PORTE Pointer                 */
    #define PF        ( ( GPIO_T * ) GPIOF_BASE )                       /*!< GPIO PORTF Pointer                 */
    #define PG        ( ( GPIO_T * ) GPIOG_BASE )                       /*!< GPIO PORTG Pointer                 */
    #define PH        ( ( GPIO_T * ) GPIOH_BASE )                       /*!< GPIO PORTH Pointer                 */

    #define UART0     ( ( UART_T * ) UART0_BASE )                       /*!< UART0 Pointer                      */
    #define UART1     ( ( UART_T * ) UART1_BASE )                       /*!< UART1 Pointer                      */
    #define UART2     ( ( UART_T * ) UART2_BASE )                       /*!< UART2 Pointer                      */
    #define UART3     ( ( UART_T * ) UART3_BASE )                       /*!< UART3 Pointer                      */
    #define UART4     ( ( UART_T * ) UART4_BASE )                       /*!< UART4 Pointer                      */
    #define UART5     ( ( UART_T * ) UART5_BASE )                       /*!< UART5 Pointer                      */


    #define TIMER0    ( ( TIMER_T * ) TMR01_BASE )                     /*!< TIMER0 Pointer                      */
    #define TIMER1    ( ( TIMER_T * ) ( TMR01_BASE + 0x100UL ) )       /*!< TIMER1 Pointer                      */
    #define TIMER2    ( ( TIMER_T * ) TMR23_BASE )                     /*!< TIMER2 Pointer                      */
    #define TIMER3    ( ( TIMER_T * ) ( TMR23_BASE + 0x100UL ) )       /*!< TIMER3 Pointer                      */

    #define WDT       ( ( WDT_T * ) WDT_BASE )                         /*!< Watch Dog Timer Pointer             */

    #define WWDT      ( ( WWDT_T * ) WWDT_BASE )                       /*!< Window Watch Dog Timer Pointer      */

    #define QSPI0     ( ( QSPI_T * ) QSPI0_BASE )                      /*!< QSPI0 Pointer                       */
    #define SPI0      ( ( SPI_T * ) SPI0_BASE )                        /*!< SPI0 Pointer                        */
    #define SPI1      ( ( SPI_T * ) SPI1_BASE )                        /*!< SPI1 Pointer                        */
    #define SPI2      ( ( SPI_T * ) SPI2_BASE )                        /*!< SPI2 Pointer                        */
    #define SPI3      ( ( SPI_T * ) SPI3_BASE )                        /*!< SPI3 Pointer                        */

    #define I2S0      ( ( I2S_T * ) I2S0_BASE )                        /*!< I2S0 Pointer                        */

    #define I2C0      ( ( I2C_T * ) I2C0_BASE )                        /*!< I2C0 Pointer                        */
    #define I2C1      ( ( I2C_T * ) I2C1_BASE )                        /*!< I2C1 Pointer                        */
    #define I2C2      ( ( I2C_T * ) I2C2_BASE )                        /*!< I2C1 Pointer                        */

    #define QEI0      ( ( QEI_T * ) QEI0_BASE )                        /*!< QEI0 Pointer                        */
    #define QEI1      ( ( QEI_T * ) QEI1_BASE )                        /*!< QEI1 Pointer                        */

    #define RTC       ( ( RTC_T * ) RTC_BASE )                         /*!< RTC Pointer                         */

    #define ACMP01    ( ( ACMP_T * ) ACMP01_BASE )                     /*!< ACMP01 Pointer                      */

    #define CLK       ( ( CLK_T * ) CLK_BASE )                         /*!< System Clock Controller Pointer     */

    #define DAC0      ( ( DAC_T * ) DAC0_BASE )                        /*!< DAC0 Pointer                        */
    #define DAC1      ( ( DAC_T * ) DAC1_BASE )                        /*!< DAC1 Pointer                        */

    #define EADC      ( ( EADC_T * ) EADC_BASE )                       /*!< EADC Pointer                        */

    #define SYS       ( ( SYS_T * ) SYS_BASE )                         /*!< System Global Controller Pointer    */

    #define SYSINT    ( ( SYS_INT_T * ) INT_BASE )                     /*!< Interrupt Source Controller Pointer */

    #define FMC       ( ( FMC_T * ) FMC_BASE )                         /*!< Flash Memory Controller */

    #define SDH0      ( ( SDH_T * ) SDH0_BASE )

    #define CRPT      ( ( CRPT_T * ) CRPT_BASE )                        /*!< Crypto Accelerator Pointer          */
    #define TRNG      ( ( TRNG_T * ) TRNG_BASE )                        /*!< True Random Number Pointer          */

    #define BPWM0     ( ( BPWM_T * ) BPWM0_BASE )                       /*!< BPWM0 Pointer                       */
    #define BPWM1     ( ( BPWM_T * ) BPWM1_BASE )                       /*!< BPWM1 Pointer                       */

    #define EPWM0     ( ( EPWM_T * ) EPWM0_BASE )                       /*!< EPWM0 Pointer                       */
    #define EPWM1     ( ( EPWM_T * ) EPWM1_BASE )                       /*!< EPWM1 Pointer                       */

    #define SC0       ( ( SC_T * ) SC0_BASE )                           /*!< SC0 Pointer                         */
    #define SC1       ( ( SC_T * ) SC1_BASE )                           /*!< SC1 Pointer                         */
    #define SC2       ( ( SC_T * ) SC2_BASE )                           /*!< SC2 Pointer                         */

    #define EBI       ( ( EBI_T * ) EBI_BASE )                          /*!< EBI Pointer                         */

