FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/M2351.h
    #define ENABLE       1
    #define DISABLE      0

/* Bit Mask Definitions */
    #define BIT0         0x00000001UL
    #define BIT1         0x00000002UL
    #define BIT2         0x00000004UL
    #define BIT3         0x00000008UL
    #define BIT4         0x00000010UL
    #define BIT5         0x00000020UL
    #define BIT6         0x00000040UL
    #define BIT7         0x00000080UL
    #define BIT8         0x00000100UL
    #define BIT9         0x00000200UL
    #define BIT10        0x00000400UL
    #define BIT11        0x00000800UL
    #define BIT12        0x00001000UL
    #define BIT13        0x00002000UL
    #define BIT14        0x00004000UL
    #define BIT15        0x00008000UL
    #define BIT16        0x00010000UL
    #define BIT17        0x00020000UL
    #define BIT18        0x00040000UL
    #define BIT19        0x00080000UL
    #define BIT20        0x00100000UL
    #define BIT21        0x00200000UL
    #define BIT22        0x00400000UL
    #define BIT23        0x00800000UL
    #define BIT24        0x01000000UL
    #define BIT25        0x02000000UL
    #define BIT26        0x04000000UL
    #define BIT27        0x08000000UL
    #define BIT28        0x10000000UL
    #define BIT29        0x20000000UL
    #define BIT30        0x40000000UL
    #define BIT31        0x80000000UL


/* Byte Mask Definitions */
    #define BYTE0_Msk    ( 0x000000FFUL )
    #define BYTE1_Msk    ( 0x0000FF00UL )
    #define BYTE2_Msk    ( 0x00FF0000UL )
    #define BYTE3_Msk    ( 0xFF000000UL )

    #define _GET_BYTE0( u32Param )    ( ( ( u32Param ) & BYTE0_Msk ) )         /*!< Extract Byte 0 (Bit  0~ 7) from parameter u32Param */
    #define _GET_BYTE1( u32Param )    ( ( ( u32Param ) & BYTE1_Msk ) >> 8UL )  /*!< Extract Byte 1 (Bit  8~15) from parameter u32Param */
    #define _GET_BYTE2( u32Param )    ( ( ( u32Param ) & BYTE2_Msk ) >> 16UL ) /*!< Extract Byte 2 (Bit 16~23) from parameter u32Param */
    #define _GET_BYTE3( u32Param )    ( ( ( u32Param ) & BYTE3_Msk ) >> 24UL ) /*!< Extract Byte 3 (Bit 24~31) from parameter u32Param */


/******************************************************************************/
/*                         Peripheral header files                            */
/******************************************************************************/
    #include "sys.h"
    #include "clk.h"
    #include "dac.h"
    #include "eadc.h"
    #include "ebi.h"
    #include "ecap.h"
    #include "fmc.h"
    #include "gpio.h"
    #include "i2c.h"
    #include "i2s.h"
    #include "bpwm.h"
    #include "epwm.h"
    #include "qspi.h"
    #include "spi.h"
    #include "timer.h"
    #include "timer_pwm.h"
    #include "wdt.h"
    #include "wwdt.h"
    #include "rtc.h"
    #include "uart.h"
    #include "acmp.h"
    #include "crc.h"
    #include "usbd.h"
    #include "otg.h"
    #include "pdma.h"
    #include "ebi.h"
    #include "crypto.h"
    #include "sc.h"
    #include "scuart.h"
    #include "usci_spi.h"
    #include "usci_uart.h"
    #include "usci_i2c.h"
    #include "sdh.h"
    #include "qei.h"
    #include "can.h"
    #include "scu.h"
    #include "mkromlib.h"

#endif /* __M2351_H__ */


/* Copyright (C) 2017 Nuvoton Technology Corp. All rights reserved. */
